{"fragment":9,"updateTime":1431802748000,"matchId":{"id":3279,"name":"ipl2015-54 - RR vs. KKR","matchIdName":"ipl2015-54"},"commentaries":[{"bbcode":"Umesh knocks to long on for a single. 15 off 4","subtype":"BBCode","message":{"text":"<p>Umesh knocks to long on for a single. 15 off 4</p>"},"tags":[],"timestamp":1431800793000,"id":1195929,"time":"18:26","updateTime":1431800770482,"sequence":400.5,"type":"Manual"},{"bbcode":"C Morris to M Morkel, %SPEED% full length on middle stump. He plays and misses","thisOver":"2","progress":{"innings":2,"over":20,"ball":3},"speed":35.9850429254711,"subtype":"BBCode","countingProgress":{"innings":2,"over":19,"ball":3},"bowlerId":836,"nonfacingBatsmanId":59,"facingBatsmanId":169,"autoText":"C Morris to M Morkel, %SPEED% full length on middle stump. He plays and misses","message":{"text":null},"tags":[],"timestamp":1431801000000,"id":1195930,"time":"18:26","updateTime":1431800783926,"sequence":401.5,"type":"Auto"},{"bbcode":"They scamper back for 2. 13 off 3. Morne has to go big!","subtype":"BBCode","message":{"text":"<p>They scamper back for 2. 13 off 3. Morne has to go big!</p>"},"tags":[],"timestamp":1431800807000,"id":1195931,"time":"18:26","updateTime":1431800807425,"sequence":402.5,"type":"Manual"},{"bbcode":"C Morris to M Morkel, %SPEED% full toss just outside off stump. He picks up a single","thisOver":"1","progress":{"innings":2,"over":20,"ball":4},"speed":38.0150893062443,"subtype":"BBCode","countingProgress":{"innings":2,"over":19,"ball":4},"bowlerId":836,"nonfacingBatsmanId":59,"facingBatsmanId":169,"autoText":"C Morris to M Morkel, %SPEED% full toss just outside off stump. He picks up a single","message":{"text":null},"tags":[],"timestamp":1431801000000,"id":1195932,"time":"18:27","updateTime":1431800831160,"sequence":403.5,"type":"Auto"},{"bbcode":"Only a single after a fantastic yorker. 12 off 2. With Umesh in this sort of form, anything is possible!","subtype":"BBCode","message":{"text":"<p>Only a single after a fantastic yorker. 12 off 2. With Umesh in this sort of form, anything is possible!</p>"},"tags":[],"timestamp":1431800851000,"id":1195933,"time":"18:27","updateTime":1431800851936,"sequence":404.5,"type":"Manual"},{"bbcode":"C Morris to U Yadav, %SPEED% full toss on middle stump. He picks up a single","thisOver":"1","progress":{"innings":2,"over":20,"ball":5},"speed":38.7125614662494,"subtype":"BBCode","countingProgress":{"innings":2,"over":19,"ball":5},"bowlerId":836,"nonfacingBatsmanId":169,"facingBatsmanId":59,"autoText":"C Morris to U Yadav, %SPEED% full toss on middle stump. He picks up a single","message":{"text":null},"tags":[],"timestamp":1431801255000,"id":1195934,"time":"18:28","updateTime":1431800881443,"sequence":405.5,"type":"Auto"},{"bbcode":"Another full ball! But Umesh can only get one","subtype":"BBCode","message":{"text":"<p>Another full ball! But Umesh can only get one</p>"},"tags":[],"timestamp":1431800899000,"id":1195935,"time":"18:28","updateTime":1431800899321,"sequence":406.5,"type":"Manual"},{"bbcode":"C Morris to M Morkel, %SPEED% full toss on leg stump. He picks up a single","thisOver":"1","progress":{"innings":2,"over":20,"ball":6},"speed":37.2601132147032,"subtype":"BBCode","countingProgress":{"innings":2,"over":19,"ball":6},"bowlerId":836,"nonfacingBatsmanId":59,"facingBatsmanId":169,"autoText":"C Morris to M Morkel, %SPEED% full toss on leg stump. He picks up a single","message":{"text":null},"tags":[],"timestamp":1431801255000,"id":1195936,"time":"18:28","updateTime":1431800913644,"sequence":407.5,"type":"Auto"},{"innings":2,"over":20,"overRuns":6,"overWickets":1,"inningsRuns":190,"inningsWickets":9,"inningsAllOut":false,"team":{"id":5,"fullName":"Kolkata Knight Riders","shortName":"Knight Riders","abbreviation":"KKR","primaryColor":"6F2C91","secondaryColor":"FFFFFF","type":"m"},"batsmanSummaries":[{"batsman":{"id":169,"fullName":"Morne Morkel","shortName":"M Morkel","nationality":"South African","rightHandedBat":false,"dateOfBirth":465868800000,"names":["Morne Morkel","M Morkel"]},"runs":4,"balls":3,"fours":0,"sixes":0},{"batsman":{"id":59,"fullName":"Umesh Yadav","shortName":"U Yadav","nationality":"Indian","rightHandedBat":false,"dateOfBirth":562118400000,"names":["Umesh Yadav","U Yadav"]},"runs":24,"balls":11,"fours":4,"sixes":1}],"activeBatsman":169,"bowlerSummary":{"bowler":{"id":836,"fullName":"Chris Morris","shortName":"C Morris","nationality":"South African","rightHandedBat":true,"dateOfBirth":546739200000,"names":["Chris Morris","C Morris"]},"overs":"4","runs":23,"wickets":4,"maidens":0},"inningsBalls":120,"inningsMaxBalls":120,"inningsTarget":200,"message":{"text":null},"tags":[],"timestamp":1431800913000,"id":1195937,"time":"18:28","updateTime":1431800913894,"sequence":408.5,"type":"Eov"},{"bbcode":"[b]Rajasthan Royals win by 9 runs[/b]","subtype":"BBCode","message":{"text":"<p><strong>Rajasthan Royals win by 9 runs</strong></p>"},"tags":[],"timestamp":1431800941000,"id":1195938,"time":"18:29","updateTime":1431800941467,"sequence":409.5,"type":"Manual"},{"bbcode":"[b]Match Report: [/b]The Rajasthan Royals confirmed their passage to the Pepsi IPL 2015 Playoffs after they defeated defending champions Kolkata Knight Riders by nine runs in a high-scoring contest at the Brabourne Stadium in Mumbai. After setting the visitors a formidable target of 200, RR held their nerves, kept pegging away at KKR wickets and restricted them to 190-9. \\n \\n Earlier in the evening, after opting to bat first on a belter of a pitch, the Rajasthan Royals rode on Shane Watson s second IPL century to post a mountain of runs on the board. The opening pair of Ajinkya Rahane and Watson helped their team to an aggressive start, adding 66 runs in the first six overs. On a surface where the ball came on to the bat nicely, both batsmen made use of the pace of the ball to pick up boundaries. \\n \\n Even Shakib-al-Hasan, who was introduced into the attack in the sixth over, wasn t spared as he was milked for 14 runs in his first over. While Watson was all muscle on the day, Rahane s innings was all about timing and finding the gap. The latter scored 37 from 22 balls   studded with three boundaries and two sixes   before he was involved in a misunderstanding in running between the wickets and was run out. The opening pair was separated at the end of the seventh over, at which point RR had raced to 80. \\n \\n Steve Smith struck two boundaries and added 30 runs in association with Watson before he whipped a waist-high full toss from Andre Russell to the man at short fineleg. RR continued to lose wickets at one end   Sanju Samson and James Faulkner were dismissed for single-digit scores, and Karun Nair perished after a quick-fire 16. But Watson motored along at the other end, scoring his half-century off 31 balls, needing only 26 balls to get to the three-figure mark. He brought up his century in style   off the first ball of the final over of the innings   when he slashed a wide delivery from Umesh and sent it on its way to the boundary. The Australian, who had relinquished captaincy a few days ago, scored the majority of his runs in front of the wicket, and was harsh on almost all the bowlers. Against Azhar Mahmood, Morne Morkel and Umesh Yadav combined, he scored 60 runs from 33 balls, while he took 28 runs from 14 balls off Shakib-al-Hasan. \\n \\n Watson remained unbeaten at the end of the twenty overs, with 104 from 59 balls and his innings was decorated with nine fours and five sixes. RR were 115 for 2 at the end of twelve overs, and applying the principle of doubling the score after twelve overs, should have reached a total in the region of 220-230. However, they were pulled back in the middle stages of the innings and could only finish with 199-6. \\n \\n For KKR, Andre Russell was the most successful bowler, returning figures of 3-32, and Umesh Yadav (1-36) was the only other wicket-taker. \\n \\n For KKR to chase the runs down, they needed one of their two openers   Robin Uthappa or Gautam Gambhir   to drop anchor and allow the other stroke-makers to flourish at the other end. Losing both opening batsmen in the first three overs set them back upfront, and that meant the rest of the batting lineup was under tremendous pressure. \\n \\n Yusuf Pathan held the innings together for a brief period of time, stitching together partnerships of 56 with Manish Pandey and 55 with Russell. But once Yusuf Pathan was dismissed   for a well-compiled 44 (35 balls)   in the sixteenth over, the contest had been killed. \\n \\n Umesh Yadav brought life briefly   right at the fag end of the innings, scoring 24 from 11 balls, but the task in front of him was just too huge. KKR finished their twenty overs at 190-9, ten runs short of what was needed. \\n \\n For RR, Dhawal Kulkarni did the damage at the top of the innings, dismissing Uthappa and Manish Pandey, while Chris Morris cleaned up the middle and lower order, picking up four wickets   including that of KKR skipper Gambhir. Morris held his nerve while bowling the final over too; with 16 runs to defend   and Shakib-al-Hasan and an on-fire Umesh Yadav to bowl to, the South African held his nerve, conceding only six runs to deny the defending champions. Watson picked up two wickets   including that of a well-set Yusuf Pathan - to cap off an outstanding day for him.","subtype":"BBCode","message":{"text":"<p><strong>Match Report:&nbsp;</strong>The Rajasthan Royals confirmed their passage to the Pepsi IPL 2015 Playoffs after they defeated defending champions Kolkata Knight Riders by nine runs in a high-scoring contest at the Brabourne Stadium in Mumbai. After setting the visitors a formidable target of 200, RR held their nerves, kept pegging away at KKR wickets and restricted them to 190-9. <br /> <br /> Earlier in the evening, after opting to bat first on a belter of a pitch, the Rajasthan Royals rode on Shane Watson&rsquo;s second IPL century to post a mountain of runs on the board. The opening pair of Ajinkya Rahane and Watson helped their team to an aggressive start, adding 66 runs in the first six overs. On a surface where the ball came on to the bat nicely, both batsmen made use of the pace of the ball to pick up boundaries. <br /> <br /> Even Shakib-al-Hasan, who was introduced into the attack in the sixth over, wasn&rsquo;t spared as he was milked for 14 runs in his first over. While Watson was all muscle on the day, Rahane&rsquo;s innings was all about timing and finding the gap. The latter scored 37 from 22 balls &ndash; studded with three boundaries and two sixes &ndash; before he was involved in a misunderstanding in running between the wickets and was run out. The opening pair was separated at the end of the seventh over, at which point RR had raced to 80. <br /> <br /> Steve Smith struck two boundaries and added 30 runs in association with Watson before he whipped a waist-high full toss from Andre Russell to the man at short fineleg. RR continued to lose wickets at one end &ndash; Sanju Samson and James Faulkner were dismissed for single-digit scores, and Karun Nair perished after a quick-fire 16. But Watson motored along at the other end, scoring his half-century off 31 balls, needing only 26 balls to get to the three-figure mark. He brought up his century in style &ndash; off the first ball of the final over of the innings &ndash; when he slashed a wide delivery from Umesh and sent it on its way to the boundary. The Australian, who had relinquished captaincy a few days ago, scored the majority of his runs in front of the wicket, and was harsh on almost all the bowlers. Against Azhar Mahmood, Morne Morkel and Umesh Yadav combined, he scored 60 runs from 33 balls, while he took 28 runs from 14 balls off Shakib-al-Hasan. <br /> <br /> Watson remained unbeaten at the end of the twenty overs, with 104 from 59 balls and his innings was decorated with nine fours and five sixes. RR were 115 for 2 at the end of twelve overs, and applying the principle of doubling the score after twelve overs, should have reached a total in the region of 220-230. However, they were pulled back in the middle stages of the innings and could only finish with 199-6. <br /> <br /> For KKR, Andre Russell was the most successful bowler, returning figures of 3-32, and Umesh Yadav (1-36) was the only other wicket-taker. <br /> <br /> For KKR to chase the runs down, they needed one of their two openers &ndash; Robin Uthappa or Gautam Gambhir &ndash; to drop anchor and allow the other stroke-makers to flourish at the other end. Losing both opening batsmen in the first three overs set them back upfront, and that meant the rest of the batting lineup was under tremendous pressure. <br /> <br /> Yusuf Pathan held the innings together for a brief period of time, stitching together partnerships of 56 with Manish Pandey and 55 with Russell. But once Yusuf Pathan was dismissed &ndash; for a well-compiled 44 (35 balls) &ndash; in the sixteenth over, the contest had been killed. <br /> <br /> Umesh Yadav brought life briefly &ndash; right at the fag end of the innings, scoring 24 from 11 balls, but the task in front of him was just too huge. KKR finished their twenty overs at 190-9, ten runs short of what was needed. <br /> <br /> For RR, Dhawal Kulkarni did the damage at the top of the innings, dismissing Uthappa and Manish Pandey, while Chris Morris cleaned up the middle and lower order, picking up four wickets &ndash; including that of KKR skipper Gambhir. Morris held his nerve while bowling the final over too; with 16 runs to defend &ndash; and Shakib-al-Hasan and an on-fire Umesh Yadav to bowl to, the South African held his nerve, conceding only six runs to deny the defending champions. Watson picked up two wickets &ndash; including that of a well-set Yusuf Pathan - to cap off an outstanding day for him.</p>"},"tags":[],"timestamp":1431802748000,"id":1195939,"time":"18:29","updateTime":1431800957795,"sequence":410.5,"type":"Manual"},{"bbcode":"[b]Gambhir: [/b]\"Obviously, the destiny was in our hands. A lot of credit needs to go to Rajasthan. The way Shane batted was exceptional. We gave our everything. Good luck to Rajasthan. We knew it was going to be a high scoring game and I thought 199 was a bit too much. Losing 3 wickets in the first 6 overs was a bit too much. The table shows the quality of all the sides. I think we played reasonably good cricket, but there were certain games we should have won. It's going to be tough, but we have to accept it.\"","subtype":"BBCode","message":{"text":"<p><strong>Gambhir:&nbsp;</strong>\"Obviously, the destiny was in our hands. A lot of credit needs to go to Rajasthan. The way Shane batted was exceptional. We gave our everything. Good luck to Rajasthan. We knew it was going to be a high scoring game and I thought 199 was a bit too much. Losing 3 wickets in the first 6 overs was a bit too much. The table shows the quality of all the sides. I think we played reasonably good cricket, but there were certain games we should have won. It's going to be tough, but we have to accept it.\"</p>"},"tags":[],"timestamp":1431801205000,"id":1195940,"time":"18:29","updateTime":1431800961892,"sequence":411.5,"type":"Manual"},{"bbcode":"[b]Smith: [/b]\"It was a massive game for us, a must win. Those are the moments you play cricket for and they're even better when you come out on top. It's been nice to have a break, and we were ready for tonight. We've got a lot of belief in this group and we believed we could turn it around. The attitude we came out with was superb. Rahane and Watson were fantastic. It got tight towards the end, but the bowlers held their nerve. We've now just got to prepare for the next game.\"","subtype":"BBCode","message":{"text":"<p><strong>Smith:&nbsp;</strong>\"It was a massive game for us, a must win. Those are the moments you play cricket for and they're even better when you come out on top. It's been nice to have a break, and we were ready for tonight. We've got a lot of belief in this group and we believed we could turn it around. The attitude we came out with was superb. Rahane and Watson were fantastic. It got tight towards the end, but the bowlers held their nerve. We've now just got to prepare for the next game.\"</p>"},"tags":[],"timestamp":1431801791000,"id":1195941,"time":"18:29","updateTime":1431800965809,"sequence":412.5,"type":"Manual"},{"bbcode":"[b]MoM: [/b]Shane Watson","subtype":"BBCode","message":{"text":"<p><strong>MoM:&nbsp;</strong>Shane Watson</p>"},"tags":[],"timestamp":1431801798000,"id":1195942,"time":"18:30","updateTime":1431801004866,"sequence":413.5,"type":"Manual"},{"subtype":"EmbeddedTweet","tweetjson":{"created_at":"Sat May 16 18:36:39 +0000 2015","id":599644647107858432,"id_str":"599644647107858432","text":"Rajasthan Royals entering the Playoffs in the League in a Royal Style! performance from Shane Watson with both bat and bowl #eit20 #PepsiIPL","source":"<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>","truncated":false,"in_reply_to_status_id":null,"in_reply_to_status_id_str":null,"in_reply_to_user_id":null,"in_reply_to_user_id_str":null,"in_reply_to_screen_name":null,"user":{"id":139713630,"id_str":"139713630","name":"Rameez Lakhani","screen_name":"ImRameezLakhani","location":"","description":"","url":null,"entities":{"description":{"urls":[]}},"protected":false,"followers_count":75,"friends_count":321,"listed_count":2,"created_at":"Mon May 03 13:09:07 +0000 2010","favourites_count":63,"utc_offset":19800,"time_zone":"Chennai","geo_enabled":true,"verified":false,"statuses_count":571,"lang":"en","contributors_enabled":false,"is_translator":false,"is_translation_enabled":false,"profile_background_color":"C0DEED","profile_background_image_url":"http://abs.twimg.com/images/themes/theme1/bg.png","profile_background_image_url_https":"https://abs.twimg.com/images/themes/theme1/bg.png","profile_background_tile":false,"profile_image_url":"http://pbs.twimg.com/profile_images/593512231632908290/wHj6Jgbu_normal.jpg","profile_image_url_https":"https://pbs.twimg.com/profile_images/593512231632908290/wHj6Jgbu_normal.jpg","profile_banner_url":"https://pbs.twimg.com/profile_banners/139713630/1430382396","profile_link_color":"0084B4","profile_sidebar_border_color":"C0DEED","profile_sidebar_fill_color":"DDEEF6","profile_text_color":"333333","profile_use_background_image":true,"default_profile":true,"default_profile_image":false,"following":false,"follow_request_sent":false,"notifications":false},"geo":null,"coordinates":null,"place":null,"contributors":null,"retweet_count":0,"favorite_count":0,"entities":{"hashtags":[{"text":"eit20","indices":[124,130]},{"text":"PepsiIPL","indices":[131,140]}],"symbols":[],"user_mentions":[],"urls":[]},"favorited":false,"retweeted":false,"lang":"en"},"message":{"text":"<blockquote class=\"twitter-tweet\" data-partner=\"tweetdeck\">\n<p lang=\"en\" dir=\"ltr\">Rajasthan Royals entering the Playoffs in the League in a Royal Style! performance from Shane Watson with both bat and bowl <a href=\"https://twitter.com/hashtag/eit20?src=hash\">#eit20</a> <a href=\"https://twitter.com/hashtag/PepsiIPL?src=hash\">#PepsiIPL</a></p>\n&mdash; Rameez Lakhani (@ImRameezLakhani) <a href=\"https://twitter.com/ImRameezLakhani/status/599644647107858432\">May 16, 2015</a></blockquote>\n<script charset=\"utf-8\" type=\"text/javascript\" src=\"http://platform.twitter.com/widgets.js\"></script>"},"tags":[],"timestamp":1431801415000,"id":1195943,"time":"18:36","updateTime":1431801415604,"sequence":414.5,"type":"Manual"},{"bbcode":"\\n\\nThat was a lot closer than Rajasthan Royals fans would have wanted, but they've held their nerve, and now can sit back and enjoy the final 2 games of the Group Stages. As for KKR, they now require Delhi Daredevils to thrash RCB to have any hope of going through. That match is first up tomorrow, before Sunrisers Hyderabad and Mumbai Indians go head to head to decide the final qualifying spot. We hope you can join us for both those games, but until then, goodbye.","subtype":"BBCode","message":{"text":"<p><img src=\"http://static2.iplt20.com/cms/media/images/960x640/43767.jpg\" alt=\"\" width=\"480\" height=\"320\" /><br /><br />That was a lot closer than Rajasthan Royals fans would have wanted, but they've held their nerve, and now can sit back and enjoy the final 2 games of the Group Stages. As for KKR, they now require Delhi Daredevils to thrash RCB to have any hope of going through. That match is first up tomorrow, before Sunrisers Hyderabad and Mumbai Indians go head to head to decide the final qualifying spot. We hope you can join us for both those games, but until then, goodbye.</p>"},"tags":[],"timestamp":1431801980000,"id":1195944,"time":"18:46","updateTime":1431801980113,"sequence":415.5,"type":"Manual"}]}