{"fragment":8,"updateTime":1431109414000,"matchId":{"id":3268,"name":"ipl2015-43 - CSK vs. MI","matchIdName":"ipl2015-43"},"commentaries":[{"bbcode":"P Negi to H Pandya, %SPEED% good length just outside off stump. He hits a great shot, that has gone all the way","thisOver":"6","progress":{"innings":2,"over":19,"ball":4},"speed":26.9810158267228,"subtype":"BBCode","countingProgress":{"innings":2,"over":18,"ball":4},"bowlerId":53,"nonfacingBatsmanId":100,"facingBatsmanId":2740,"autoText":"P Negi to H Pandya, %SPEED% good length just outside off stump. He hits a great shot, that has gone all the way","message":{"text":null},"tags":["six"],"timestamp":1431107068000,"id":1190629,"time":"17:43","updateTime":1431106983510,"sequence":350.0,"type":"Auto"},{"bbcode":"[b]Six![/b] Pandya can't stop! He bludgeons over long on and swings the match his sides way once more","subtype":"BBCode","message":{"text":"<p><strong>Six!</strong> Pandya can't stop! He bludgeons over long on and swings the match his sides way once more</p>"},"tags":[],"timestamp":1431107046000,"id":1190630,"time":"17:43","updateTime":1431107016835,"sequence":351.0,"type":"Manual"},{"bbcode":"P Negi to H Pandya, 1 bye","thisOver":"1B","progress":{"innings":2,"over":19,"ball":5},"speed":27.3000702810797,"subtype":"BBCode","countingProgress":{"innings":2,"over":18,"ball":5},"bowlerId":53,"nonfacingBatsmanId":100,"facingBatsmanId":2740,"autoText":"P Negi to H Pandya, 1 bye","message":{"text":null},"tags":[],"timestamp":1431107112000,"id":1190638,"time":"17:45","updateTime":1431107112949,"sequence":354.5,"type":"Auto"},{"bbcode":"P Negi to A Rayudu, %SPEED% good length on middle stump. He hits a great shot, that has gone all the way","thisOver":"6","progress":{"innings":2,"over":19,"ball":6},"speed":26.5576946572489,"subtype":"BBCode","countingProgress":{"innings":2,"over":18,"ball":6},"bowlerId":53,"nonfacingBatsmanId":2740,"facingBatsmanId":100,"autoText":"P Negi to A Rayudu, %SPEED% good length on middle stump. He hits a great shot, that has gone all the way","message":{"text":null},"tags":["six"],"timestamp":1431107122000,"id":1190639,"time":"17:45","updateTime":1431107116417,"sequence":355.5,"type":"Auto"},{"bbcode":"[b]Six![/b] Sensational! Rayudu follows suit with another huge blow down the ground. That over has changed the match!","subtype":"BBCode","message":{"text":"<p><strong>Six!</strong>&nbsp;Sensational! Rayudu follows suit with another huge blow down the ground. That over has changed the match!</p>"},"tags":[],"timestamp":1431107175000,"id":1190634,"time":"17:44","updateTime":1431107088244,"sequence":356.0,"type":"Manual"},{"innings":2,"over":19,"overRuns":25,"overWickets":0,"inningsRuns":154,"inningsWickets":4,"inningsAllOut":false,"team":{"id":6,"fullName":"Mumbai Indians","shortName":"Mumbai","abbreviation":"MI","primaryColor":"00AEEF","secondaryColor":"FFFFFF","type":"m"},"batsmanSummaries":[{"batsman":{"id":100,"fullName":"Ambati Rayudu","shortName":"A Rayudu","nationality":"Indian","rightHandedBat":true,"dateOfBirth":496281600000,"names":["Ambati Rayudu","A Rayudu"]},"runs":30,"balls":18,"fours":0,"sixes":3},{"batsman":{"id":2740,"fullName":"Hardik Pandya","shortName":"H Pandya","nationality":"Indian","rightHandedBat":true,"dateOfBirth":750297600000,"names":["Hardik Pandya","H Pandya"]},"runs":20,"balls":7,"fours":0,"sixes":3}],"activeBatsman":2740,"bowlerSummary":{"bowler":{"id":53,"fullName":"Pawan Negi","shortName":"P Negi","nationality":"Indian","rightHandedBat":false,"dateOfBirth":410659200000,"names":["Pawan Negi","P Negi"]},"overs":"4","runs":34,"wickets":0,"maidens":0},"inningsBalls":114,"inningsMaxBalls":120,"inningsTarget":159,"message":{"text":null},"tags":[],"timestamp":1431107116000,"id":1190640,"time":"17:45","updateTime":1431107116651,"sequence":356.5,"type":"Eov"},{"bbcode":"DJ Bravo to H Pandya, %SPEED% short length on middle stump. He plays and misses","thisOver":"1","progress":{"innings":2,"over":20,"ball":1},"speed":28.6914637943877,"subtype":"BBCode","countingProgress":{"innings":2,"over":19,"ball":1},"bowlerId":25,"nonfacingBatsmanId":100,"facingBatsmanId":2740,"autoText":"DJ Bravo to H Pandya, %SPEED% short length on middle stump. He plays and misses","message":{"text":null},"tags":[],"timestamp":1431107235000,"id":1190643,"time":"17:46","updateTime":1431107197931,"sequence":357.5,"type":"Auto"},{"bbcode":"[b]Dropped! [/b] Clubbed into the leg side, three men converge but Jadeja takes it on and it slips through his mitts","subtype":"BBCode","message":{"text":"<p><strong>Dropped!&nbsp;</strong> Clubbed into the leg side, three men converge but Jadeja takes it on and it slips through his mitts</p>"},"tags":[],"timestamp":1431107243000,"id":1190644,"time":"17:47","updateTime":1431107230000,"sequence":358.5,"type":"Manual"},{"bbcode":"DJ Bravo to A Rayudu, %SPEED% short length just outside off stump. He plays and misses","thisOver":"4","progress":{"innings":2,"over":20,"ball":2},"speed":29.9993220029496,"subtype":"BBCode","countingProgress":{"innings":2,"over":19,"ball":2},"bowlerId":25,"nonfacingBatsmanId":2740,"facingBatsmanId":100,"autoText":"DJ Bravo to A Rayudu, %SPEED% short length just outside off stump. He plays and misses","message":{"text":null},"tags":["four"],"timestamp":1431108038000,"id":1190645,"time":"17:47","updateTime":1431107244453,"sequence":359.5,"type":"Auto"},{"bbcode":"Four! Slogged of the front foot and a top edge gets the winning runs! What a finish!","subtype":"BBCode","message":{"text":"<p>Four! Slogged of the front foot and a top edge gets the winning runs! What a finish!</p>"},"tags":[],"timestamp":1431108166000,"id":1190647,"time":"17:47","updateTime":1431107254703,"sequence":360.0,"type":"Manual"},{"innings":2,"over":20,"overRuns":5,"overWickets":0,"inningsRuns":159,"inningsWickets":4,"inningsAllOut":false,"team":{"id":6,"fullName":"Mumbai Indians","shortName":"Mumbai","abbreviation":"MI","primaryColor":"00AEEF","secondaryColor":"FFFFFF","type":"m"},"batsmanSummaries":[{"batsman":{"id":100,"fullName":"Ambati Rayudu","shortName":"A Rayudu","nationality":"Indian","rightHandedBat":true,"dateOfBirth":496281600000,"names":["Ambati Rayudu","A Rayudu"]},"runs":34,"balls":19,"fours":1,"sixes":3},{"batsman":{"id":2740,"fullName":"Hardik Pandya","shortName":"H Pandya","nationality":"Indian","rightHandedBat":true,"dateOfBirth":750297600000,"names":["Hardik Pandya","H Pandya"]},"runs":21,"balls":8,"fours":0,"sixes":3}],"activeBatsman":100,"bowlerSummary":{"bowler":{"id":25,"fullName":"Dwayne Bravo","shortName":"DJ Bravo","nationality":"West Indian","rightHandedBat":false,"dateOfBirth":434332800000,"names":["Dwayne Bravo","DJ Bravo"]},"overs":"2.2","runs":16,"wickets":1,"maidens":0},"inningsBalls":116,"inningsMaxBalls":120,"inningsTarget":159,"message":{"text":null},"tags":[],"timestamp":1431107244000,"id":1190646,"time":"17:47","updateTime":1431107244575,"sequence":360.5,"type":"Eov"},{"bbcode":"[b]Mumbai Indians win by 6 wickets[/b]","subtype":"BBCode","message":{"text":"<p><strong>Mumbai Indians win by 6 wickets</strong></p>"},"tags":[],"timestamp":1431107270000,"id":1190649,"time":"17:47","updateTime":1431107270700,"sequence":361.5,"type":"Manual"},{"bbcode":"[b]Match Report: [/b] In a match with several twists and turns, the Mumbai Indians held their nerve and recovered from a mid-innings collapse to hand the Chennai Super their first defeat at home in Pepsi IPL 2015. Given to chase 159 on a slow track at the MA Chidambaram Stadium in Chennai, MI got off to a solid start before they lost three wickets in a short period of time. They then recovered through Ambati Rayudu and Hardik Pandya to get past the finish line in the final over with six wickets in hand. \\n\\n The diminutive Parthiv Patel set the pace for the visitors at the start of the run chase; the left-hander struck the first five boundaries in the innings and raced away to 27 from 15 balls even as his partner Lendl Simmons was slow to get off the blocks. Simmons joined the party in the fifth over when he welcomed Ashish Nehra with a six and then hit two boundaries in the same over. \\n\\n By the time the field restrictions were relaxed at the end of six overs, MI had raced to 61, with both batsmen scoring 30 runs apiece. The pair stretched their association to 84 runs, before Parthiv attempted a slog sweep which was pouched by Faf du Plessis at the edge of the long on boundary. Simmons perished two balls later when his attempted slog sweep landed in the hands of Dwayne Smith at midwicket. Parthiv made 45 from 32 balls and Simmons made 38 from 31 balls. MI, who were 84 for no loss at the half-way stage, had suddenly slumped to 85 for 2 in 10.4 overs. \\n\\n Soon after, a sharp piece of fielding by Dwayne Bravo resulted in the run out of Kieron Pollard (1) and MI had lost three wickets for two runs. That gave CSK the opportunity to put pressure on the visitors and MS Dhoni duly tightened the screws. MI only scored 15 runs in the following three overs bowled by Ravindra Jadeja and Pawan Negi. The required run rate, which had at one point touched a low of 7.00, had reached 11.60 heading into the final five overs. \\n\\n Rohit Sharma, who earned a life when he was put down by Faf du Plessis on 13, didn t capitalise on that opportunity and holed out to Suresh Raina at long on shortly after. CSK had their noses in front at that point in time, with MI needing 34 from the last 17 deliveries. That is when Ambati Rayudu and Hardik Pandya turned the heat on; both batsmen targeted the penultimate over of the match   bowled by Negi. Pandya hit three sixes in four deliveries, while Rayudu hit the final ball of the over for a six to ensure the scales tilted decidedly in favour of his team. \\n\\n Rayudu scored the winning runs off the second ball of the final over and remained unbeaten on 34 from 19 balls, while Pandya had 21 runs against his name from eight balls. \\n\\n For CSK, R Ashwin, who was included in the paying XI after having recovered from his finger injury, opened the bowling, and bowled his four overs in the first eleven overs; his figures read 4-0-17-2, which included the scalps of the two opening batsmen. Pawan Negi was outstanding too; bowling slower through the air, hitting the right lengths, allowing the ball to do its bit off the pitch and forcing the batsmen to generate their own pace; he bowled three very good overs, before the disastrous fourth over. \\n\\n Earlier in the evening, the Chennai Super Kings couldn t capitalise on a rollicking start provided by their opening pair of Dwayne Smith and Brendon McCullum. The openers added 44 runs in quick time   with McCullum scoring 23 runs from 11 balls   before they were separated. After McCullum had picked the lone man patrolling the midwicket boundary, MI dismissed Suresh Raina and Smith before the half-way mark   Hardik Pandya taking the catches to send back all three batsmen. Smith consumed 34 balls and scored 27 runs before he became Harbhajan Singh s victim in the tenth over. \\n\\n CSK skipper MS Dhoni struck a six very early in his innings, but his innings generally operated on a construct mode; he and Faf du Plessis ran well between the wickets and added 39 runs in six overs before the latter s innings was cut short by a sharp catch by Lendl Simmons at short fine leg. From 104 for 4 when du Plessis was dismissed in the sixteenth over, with only Dhoni and the lower middle order remaining, it appeared that CSK would end up with a total of 140 on the board. \\n\\n However, in those difficult circumstances emerged a new hero for the hosts. Pawan Negi, batting at number six, gave the innings the much needed impetus. The left-hander blasted his way   hitting a six and four boundaries   to 36 from 17 balls before being run out of the last ball of the innings. His partnership with his captain lasted 4.4 overs, but was worth 54 runs. Dhoni struck two boundaries and two sixes in his 32-ball 39 as CSK finished their twenty overs at 158-5. \\n\\n For the visitors, J Suchith was the most economical of the specialist bowlers; the left-arm spinner bowled his four overs conceding only 21 runs, while also picking up the wicket of the dangerous Raina. Mitchell McClenaghan, R Vinay Kumar and Harbhajan Singh picked up a wicket apiece.","subtype":"BBCode","message":{"text":"<p><strong>Match Report:&nbsp;</strong> In a match with several twists and turns, the Mumbai Indians held their nerve and recovered from a mid-innings collapse to hand the Chennai Super their first defeat at home in Pepsi IPL 2015. Given to chase 159 on a slow track at the MA Chidambaram Stadium in Chennai, MI got off to a solid start before they lost three wickets in a short period of time. They then recovered through Ambati Rayudu and Hardik Pandya to get past the finish line in the final over with six wickets in hand. <br /><br /> The diminutive Parthiv Patel set the pace for the visitors at the start of the run chase; the left-hander struck the first five boundaries in the innings and raced away to 27 from 15 balls even as his partner Lendl Simmons was slow to get off the blocks. Simmons joined the party in the fifth over when he welcomed Ashish Nehra with a six and then hit two boundaries in the same over. <br /><br /> By the time the field restrictions were relaxed at the end of six overs, MI had raced to 61, with both batsmen scoring 30 runs apiece. The pair stretched their association to 84 runs, before Parthiv attempted a slog sweep which was pouched by Faf du Plessis at the edge of the long on boundary. Simmons perished two balls later when his attempted slog sweep landed in the hands of Dwayne Smith at midwicket. Parthiv made 45 from 32 balls and Simmons made 38 from 31 balls. MI, who were 84 for no loss at the half-way stage, had suddenly slumped to 85 for 2 in 10.4 overs. <br /><br /> Soon after, a sharp piece of fielding by Dwayne Bravo resulted in the run out of Kieron Pollard (1) and MI had lost three wickets for two runs. That gave CSK the opportunity to put pressure on the visitors and MS Dhoni duly tightened the screws. MI only scored 15 runs in the following three overs bowled by Ravindra Jadeja and Pawan Negi. The required run rate, which had at one point touched a low of 7.00, had reached 11.60 heading into the final five overs. <br /><br /> Rohit Sharma, who earned a life when he was put down by Faf du Plessis on 13, didn&rsquo;t capitalise on that opportunity and holed out to Suresh Raina at long on shortly after. CSK had their noses in front at that point in time, with MI needing 34 from the last 17 deliveries. That is when Ambati Rayudu and Hardik Pandya turned the heat on; both batsmen targeted the penultimate over of the match &ndash; bowled by Negi. Pandya hit three sixes in four deliveries, while Rayudu hit the final ball of the over for a six to ensure the scales tilted decidedly in favour of his team. <br /><br /> Rayudu scored the winning runs off the second ball of the final over and remained unbeaten on 34 from 19 balls, while Pandya had 21 runs against his name from eight balls. <br /><br /> For CSK, R Ashwin, who was included in the paying XI after having recovered from his finger injury, opened the bowling, and bowled his four overs in the first eleven overs; his figures read 4-0-17-2, which included the scalps of the two opening batsmen. Pawan Negi was outstanding too; bowling slower through the air, hitting the right lengths, allowing the ball to do its bit off the pitch and forcing the batsmen to generate their own pace; he bowled three very good overs, before the disastrous fourth over. <br /><br /> Earlier in the evening, the Chennai Super Kings couldn&rsquo;t capitalise on a rollicking start provided by their opening pair of Dwayne Smith and Brendon McCullum. The openers added 44 runs in quick time &ndash; with McCullum scoring 23 runs from 11 balls &ndash; before they were separated. After McCullum had picked the lone man patrolling the midwicket boundary, MI dismissed Suresh Raina and Smith before the half-way mark &ndash; Hardik Pandya taking the catches to send back all three batsmen. Smith consumed 34 balls and scored 27 runs before he became Harbhajan Singh&rsquo;s victim in the tenth over. <br /><br /> CSK skipper MS Dhoni struck a six very early in his innings, but his innings generally operated on a construct mode; he and Faf du Plessis ran well between the wickets and added 39 runs in six overs before the latter&rsquo;s innings was cut short by a sharp catch by Lendl Simmons at short fine leg. From 104 for 4 when du Plessis was dismissed in the sixteenth over, with only Dhoni and the lower middle order remaining, it appeared that CSK would end up with a total of 140 on the board. <br /><br /> However, in those difficult circumstances emerged a new hero for the hosts. Pawan Negi, batting at number six, gave the innings the much needed impetus. The left-hander blasted his way &ndash; hitting a six and four boundaries &ndash; to 36 from 17 balls before being run out of the last ball of the innings. His partnership with his captain lasted 4.4 overs, but was worth 54 runs. Dhoni struck two boundaries and two sixes in his 32-ball 39 as CSK finished their twenty overs at 158-5. <br /><br /> For the visitors, J Suchith was the most economical of the specialist bowlers; the left-arm spinner bowled his four overs conceding only 21 runs, while also picking up the wicket of the dangerous Raina. Mitchell McClenaghan, R Vinay Kumar and Harbhajan Singh picked up a wicket apiece.</p>"},"tags":[],"timestamp":1431109414000,"id":1190650,"time":"17:48","updateTime":1431107329959,"sequence":362.5,"type":"Manual"},{"bbcode":"[b]Dhoni: [/b]\"I don't think our fast bowlers bowled very well, I made a tactical error in the end. The fast bowlers need to step up, yes we have the Purple Cap but we need to do better. This is a long tournament so you are bound to drop catches but there were a few guys where weren't on the field tonight. It is important to win games like this but there are times when you lose close games.\"","subtype":"BBCode","message":{"text":"<p><strong>Dhoni:&nbsp;</strong>\"I don't think our fast bowlers bowled very well, I made a tactical error in the end. The fast bowlers need to step up, yes we have the Purple Cap but we need to do better. This is a long tournament so you are bound to drop catches but there were a few guys where weren't on the field tonight. It is important to win games like this but there are times when you lose close games.\"</p>"},"tags":[],"timestamp":1431107573000,"id":1190651,"time":"17:48","updateTime":1431107334914,"sequence":363.5,"type":"Manual"},{"bbcode":"[b]Rohit: [/b]\"Pandya strikes the ball really well and we saw that today, we wanted him to do the job and he did it. We want this badly and we wanted to win this match what ever the situation. In the end I am really happy with the way we finished off. It was a good bowling effort but we want to set high standards in the field and we didn't do that today. With the table so tight we have to continue playing well and you never know, we have to be on top form to qualify.\"","subtype":"BBCode","message":{"text":"<p><strong>Rohit:&nbsp;</strong>\"Pandya strikes the ball really well and we saw that today, we wanted him to do the job and he did it. We want this badly and we wanted to win this match what ever the situation. In the end I am really happy with the way we finished off. It was a good bowling effort but we want to set high standards in the field and we didn't do that today. With the table so tight we have to continue playing well and you never know, we have to be on top form to qualify.\"</p>"},"tags":[],"timestamp":1431108355000,"id":1190652,"time":"17:49","updateTime":1431107340631,"sequence":364.5,"type":"Manual"},{"bbcode":"[b]MoM: [/b]Hardik Pandya","subtype":"BBCode","message":{"text":"<p><strong>MoM:&nbsp;</strong>Hardik Pandya</p>"},"tags":[],"timestamp":1431108377000,"id":1190653,"time":"17:49","updateTime":1431107345050,"sequence":365.5,"type":"Manual"},{"bbcode":"\\n\\nMI were impressive in the field despite some costly dropped catches. They started brilliantly with the bat and a strong opening partnership put them in pole position for the win. CSK then bounced back in the middle overs and a cluster of wickets made it anybody's game, Rayudu and Pandya finished the match in style and produced some of their best cricket of their IPL campaign so far. It has been a wonderful match and one we hope you enjoyed, see you tomorrow for the double header where KKR play KXIP and DD go up against SRH.","subtype":"BBCode","message":{"text":"<p><img src=\"http://static2.iplt20.com/cms/media/images/1200x800/41469.jpg\" alt=\"\" width=\"600\" height=\"400\" /><br /><br />MI were impressive in the field despite some costly dropped catches. They started brilliantly with the bat and a strong opening partnership put them in pole position for the win. CSK then bounced back in the middle overs and a cluster of wickets made it anybody's game, Rayudu and Pandya finished the match in style and produced some of their best cricket of their IPL campaign so far. It has been a wonderful match and one we hope you enjoyed, see you tomorrow for the double header where KKR play KXIP and DD go up against SRH.</p>"},"tags":[],"timestamp":1431107900000,"id":1190654,"time":"17:58","updateTime":1431107900219,"sequence":366.5,"type":"Manual"}]}