{"fragment":9,"updateTime":1462527943000,"matchId":{"id":3243,"name":"ipl2015-18 - RR vs. KXIP","matchIdName":"ipl2015-18"},"commentaries":[{"bbcode":"[b]Match Report: [/b]The first return fixture of Pepsi IPL 2015 turned out to be a thrilling contest as the Rajasthan Royals and Kings XI Punjab finished with identical scores at the end of 40 overs of the regular contest and it needed a Super Over to decide which of the two teams would take home the two points from the match. \\n \\n Chris Morris began the super-over contest by getting David Miller lbw off the first ball with a straight low full-toss. Shaun Marsh, who was fresh from his scintillating knock of 65 off 40 balls, creamed three deliveries for fours to give the Royals a target of 16. \\n \\n Kings XI wrapped up things with three balls left. First Mitchell Johnson dismissed Shane Watson off the first ball with a scorching yorker and then Wriddhiman Saha affected a run-out after James Faulkner missed a slower one. \\n \\n Hence, the Kings broke the Royals  winning streak in Pepsi IPL 2015. \\n \\n Powered by Marsh, who was playing his first match of the season, KXIP showed guts to chase down 192 to hand the table-toppers their first defeat of Pepsi IPL 2015. Despite not getting the best of starts, KXIP recovered a late charge from David Miller, who celebrated his comeback into the team with a fantastic half-century. \\n \\n There was a method in the way RR s opening pair of Ajinkya Rahane and Shane Watson operated. Watson struck the first boundary of the innings, but struggled to force the pace through the rest of the initial overs. When the fielding restrictions were relaxed at the end of six overs, RR had 43 runs on the board; Watson had scored 10 off 19 balls, while Rahane had raced to 29 from 17 balls with the help of five boundaries. \\n \\n Rahane firmed up his position at the top of the Orange Cap standings scoring his third consecutive half-century and finishing as RR s top-scorer. The right-hander batted sensibly, and played some crisp strokes without taking any unnecessary risks; he pierced the fields with precision, played some eye-candy whip shots off deliveries on the pads and drives through the off-side. The 26-year old was quick off the blocks but thereafter dropped anchor at one end and ticked the strike over consistently, allowing all the other stroke-makers in the team to play with freedom. He was eventually dismissed in the eighteenth over   with the RR score reading 162 - when he attempted to chase a wide delivery from Mitchell Johnson, but only managed to feather the ball to the wicket-keeper. He made 74 from 54 balls and hit six boundaries and two sixes. \\n \\n Watson, who had struggled in the first six overs, cashed in when Shivam Sharma was introduced into the attack in the ninth over. The Australian hit the off-spinner for three fours and a six, and followed it up with a six off Axar Patel in the next over. He made 45 from 35 balls   during which he hit five boundaries and two sixes   before he was beaten by an arm ball by Axar Patel and was stumped by an alert Wriddhiman Saha. His partnership with Rahane lasted 11.3 overs and benefitted the team to the extent of 95 runs. \\n \\n Given the platform they had, it was surprising to see RR experiment with their batting order, rather than not going for the jugular. Deepak Hooda was promoted to number three, and the youngster responded with a nine-ball 19. Karun Nair, batting ahead of James Faulkner, impressed too, scoring 25 off 13 balls. Stuart Binny and Sanju Samson gave the innings the finishing touches scoring 17 off six deliveries together as RR finished their innings at 191 for 6. \\n \\n For Kings XI Punjab, the left-arm spinner Axar Patel was the most successful bowler returning figures of two for 30. Sandeep Sharma was impressive yet again, but had only one wicket to show for his efforts. \\n \\n When it was their turn to defend the runs, RR kept plugging away at their opponents. Both openers were dismissed run out and danger man Glenn Maxwell was dismissed by leg-spinner Pravin Tewatia to reduce KXIP to 59 for 3 in the ninth over. \\n \\n That was the moment KXIP wrested the initiative and turned the pressure back on the hosts. The two players who made their way into the KXIP XI   Shaun Marsh and David Miller   stitched together a 58-run partnership. Marsh, playing his first match of the season, raced to 50 off 32 balls, and carried on to 65 before he didn t pick a googly and holed out to Rahane at long-on. Marsh celebrated his call-up to the KXIP XI, brought up his first half-century of the season.","subtype":"BBCode","message":{"text":"<p><strong>Match Report:&nbsp;</strong>The first return fixture of Pepsi IPL 2015 turned out to be a thrilling contest as the Rajasthan Royals and Kings XI Punjab finished with identical scores at the end of 40 overs of the regular contest and it needed a Super Over to decide which of the two teams would take home the two points from the match. <br /> <br /> Chris Morris began the super-over contest by getting David Miller lbw off the first ball with a straight low full-toss. Shaun Marsh, who was fresh from his scintillating knock of 65 off 40 balls, creamed three deliveries for fours to give the Royals a target of 16. <br /> <br /> Kings XI wrapped up things with three balls left. First Mitchell Johnson dismissed Shane Watson off the first ball with a scorching yorker and then Wriddhiman Saha affected a run-out after James Faulkner missed a slower one. <br /> <br /> Hence, the Kings broke the Royals&rsquo; winning streak in Pepsi IPL 2015. <br /> <br /> Powered by Marsh, who was playing his first match of the season, KXIP showed guts to chase down 192 to hand the table-toppers their first defeat of Pepsi IPL 2015. Despite not getting the best of starts, KXIP recovered a late charge from David Miller, who celebrated his comeback into the team with a fantastic half-century. <br /> <br /> There was a method in the way RR&rsquo;s opening pair of Ajinkya Rahane and Shane Watson operated. Watson struck the first boundary of the innings, but struggled to force the pace through the rest of the initial overs. When the fielding restrictions were relaxed at the end of six overs, RR had 43 runs on the board; Watson had scored 10 off 19 balls, while Rahane had raced to 29 from 17 balls with the help of five boundaries. <br /> <br /> Rahane firmed up his position at the top of the Orange Cap standings scoring his third consecutive half-century and finishing as RR&rsquo;s top-scorer. The right-hander batted sensibly, and played some crisp strokes without taking any unnecessary risks; he pierced the fields with precision, played some eye-candy whip shots off deliveries on the pads and drives through the off-side. The 26-year old was quick off the blocks but thereafter dropped anchor at one end and ticked the strike over consistently, allowing all the other stroke-makers in the team to play with freedom. He was eventually dismissed in the eighteenth over &ndash; with the RR score reading 162 - when he attempted to chase a wide delivery from Mitchell Johnson, but only managed to feather the ball to the wicket-keeper. He made 74 from 54 balls and hit six boundaries and two sixes. <br /> <br /> Watson, who had struggled in the first six overs, cashed in when Shivam Sharma was introduced into the attack in the ninth over. The Australian hit the off-spinner for three fours and a six, and followed it up with a six off Axar Patel in the next over. He made 45 from 35 balls &ndash; during which he hit five boundaries and two sixes &ndash; before he was beaten by an arm ball by Axar Patel and was stumped by an alert Wriddhiman Saha. His partnership with Rahane lasted 11.3 overs and benefitted the team to the extent of 95 runs. <br /> <br /> Given the platform they had, it was surprising to see RR experiment with their batting order, rather than not going for the jugular. Deepak Hooda was promoted to number three, and the youngster responded with a nine-ball 19. Karun Nair, batting ahead of James Faulkner, impressed too, scoring 25 off 13 balls. Stuart Binny and Sanju Samson gave the innings the finishing touches scoring 17 off six deliveries together as RR finished their innings at 191 for 6. <br /> <br /> For Kings XI Punjab, the left-arm spinner Axar Patel was the most successful bowler returning figures of two for 30. Sandeep Sharma was impressive yet again, but had only one wicket to show for his efforts. <br /> <br /> When it was their turn to defend the runs, RR kept plugging away at their opponents. Both openers were dismissed run out and danger man Glenn Maxwell was dismissed by leg-spinner Pravin Tewatia to reduce KXIP to 59 for 3 in the ninth over. <br /> <br /> That was the moment KXIP wrested the initiative and turned the pressure back on the hosts. The two players who made their way into the KXIP XI &ndash; Shaun Marsh and David Miller &ndash; stitched together a 58-run partnership. Marsh, playing his first match of the season, raced to 50 off 32 balls, and carried on to 65 before he didn&rsquo;t pick a googly and holed out to Rahane at long-on. Marsh celebrated his call-up to the KXIP XI, brought up his first half-century of the season.</p>"},"tags":[],"timestamp":1429644349000,"id":1168375,"time":"18:24","updateTime":1429640695350,"sequence":400.5,"type":"Manual"},{"bbcode":"[b]Watson: [/b]\"It was a great game of cricket! It is hard to realise what happened but Marsh and Miller batted brilliantly, they played well it is no doubt. The Super Over you hardly ever play it so you just have to come out on the fly, we will learn from it though. We gave our best tonight but it was just not enough.\"","subtype":"BBCode","message":{"text":"<p><strong>Watson:&nbsp;</strong>\"It was a great game of cricket! It is hard to realise what happened but Marsh and Miller batted brilliantly, they played well it is no doubt. The Super Over you hardly ever play it so you just have to come out on the fly, we will learn from it though. We gave our best tonight but it was just not enough.\"</p>"},"tags":[],"timestamp":1429640941000,"id":1168377,"time":"18:25","updateTime":1429640703792,"sequence":401.5,"type":"Manual"},{"bbcode":"[b]Sehwag: [/b]\"It's a great game![b] [/b]Johnson was the fastest and most experienced so we gave him the ball in the Super Over. The way we batted, the credit goes to the whole team especially Marsh and Miller. I was very excited with the situation as captain, it is cool now. If you want to stay in the contest you have to win games, RR are number one so it is a good victory.\"","subtype":"BBCode","message":{"text":"<p><strong>Sehwag: </strong>\"It's a great game!<strong>&nbsp;</strong>Johnson was the fastest and most experienced so we gave him the ball in the Super Over. The way we batted, the credit goes to the whole team especially Marsh and Miller. I was very excited with the situation as captain, it is cool now. If you want to stay in the contest you have to win games, RR are number one so it is a good victory.\"</p>"},"tags":[],"timestamp":1429641539000,"id":1168378,"time":"18:25","updateTime":1429640708221,"sequence":402.5,"type":"Manual"},{"bbcode":"[b]MoM: [/b]Shaun Marsh","subtype":"BBCode","message":{"text":"<p><strong>MoM:&nbsp;</strong>Shaun Marsh</p>"},"tags":[],"timestamp":1429641505000,"id":1168379,"time":"18:25","updateTime":1429640713209,"sequence":403.5,"type":"Manual"},{"subtype":"EmbeddedTweet","tweetjson":{"created_at":"Tue Apr 21 18:37:29 +0000 2015","id":590585159306584065,"id_str":"590585159306584065","text":"So much action in one day! #KingsXI vs #RR","source":"<a href=\"http://www.twitter.com\" rel=\"nofollow\">Twitter for Windows Phone</a>","truncated":false,"in_reply_to_status_id":null,"in_reply_to_status_id_str":null,"in_reply_to_user_id":null,"in_reply_to_user_id_str":null,"in_reply_to_screen_name":null,"user":{"id":78941611,"id_str":"78941611","name":"Harsha Bhogle","screen_name":"bhogleharsha","location":"Mumbai, India","profile_location":null,"description":"Challenge. Discover. And take what emerges in 2015.   http://t.co/vUle34EZ5D","url":null,"entities":{"description":{"urls":[{"url":"http://t.co/vUle34EZ5D","expanded_url":"http://harshabhogle.com","display_url":"harshabhogle.com","indices":[54,76]}]}},"protected":false,"followers_count":5221892,"friends_count":140,"listed_count":5455,"created_at":"Thu Oct 01 16:18:03 +0000 2009","favourites_count":18,"utc_offset":19800,"time_zone":"Chennai","geo_enabled":false,"verified":true,"statuses_count":28109,"lang":"en","contributors_enabled":false,"is_translator":false,"is_translation_enabled":false,"profile_background_color":"C0DEED","profile_background_image_url":"http://abs.twimg.com/images/themes/theme1/bg.png","profile_background_image_url_https":"https://abs.twimg.com/images/themes/theme1/bg.png","profile_background_tile":false,"profile_image_url":"http://pbs.twimg.com/profile_images/514712216109465601/5R1tjTL7_normal.jpeg","profile_image_url_https":"https://pbs.twimg.com/profile_images/514712216109465601/5R1tjTL7_normal.jpeg","profile_link_color":"0084B4","profile_sidebar_border_color":"C0DEED","profile_sidebar_fill_color":"DDEEF6","profile_text_color":"333333","profile_use_background_image":true,"default_profile":true,"default_profile_image":false,"following":false,"follow_request_sent":false,"notifications":false},"geo":null,"coordinates":null,"place":null,"contributors":null,"retweet_count":48,"favorite_count":53,"entities":{"hashtags":[{"text":"KingsXI","indices":[27,35]},{"text":"RR","indices":[39,42]}],"symbols":[],"user_mentions":[],"urls":[]},"favorited":false,"retweeted":false,"lang":"en"},"message":{"text":"<blockquote class=\"twitter-tweet\" data-partner=\"tweetdeck\">\n<p>So much action in one day! <a href=\"https://twitter.com/hashtag/KingsXI?src=hash\">#KingsXI</a> vs <a href=\"https://twitter.com/hashtag/RR?src=hash\">#RR</a></p>\n&mdash; Harsha Bhogle (@bhogleharsha) <a href=\"https://twitter.com/bhogleharsha/status/590585159306584065\">April 21, 2015</a></blockquote>\n<script charset=\"utf-8\" type=\"text/javascript\" src=\"http://platform.twitter.com/widgets.js\"></script>"},"tags":[],"timestamp":1429641602000,"id":1168412,"time":"18:39","updateTime":1429641598711,"sequence":404.0,"type":"Manual"},{"bbcode":"This is why we love the IPL! KXIP produce a remarkable result and end the Royals' winning streak. It required the finest of margins and produced some of the most dramatic scenes in the competitions history. It will be a match the Kings XI fans will never forget. Catch your breath and join us for a double headed day where the Sunrisers Hyderabad meet KKR in Visakhapatnam and RCB meet CSK in Bengaluru.","subtype":"BBCode","message":{"text":"<p>This is why we love the IPL! KXIP produce a remarkable result and end the Royals' winning streak. It required the finest of margins and produced some of the most dramatic scenes in the competitions history. It will be a match the Kings XI fans will never forget. Catch your breath and join us for a double headed day where the Sunrisers Hyderabad meet KKR in&nbsp;Visakhapatnam and RCB meet CSK in Bengaluru.</p>"},"tags":[],"timestamp":1429641205000,"id":1168395,"time":"18:33","updateTime":1429641205421,"sequence":404.5,"type":"Manual"}]}