{"fragment":8,"updateTime":1429453120000,"matchId":{"id":3240,"name":"ipl2015-15 - RR vs. CSK","matchIdName":"ipl2015-15"},"commentaries":[{"bbcode":"The scores are tied...","subtype":"BBCode","message":{"text":"<p>The scores are tied...</p>"},"tags":[],"timestamp":1429450987000,"id":1166360,"time":"13:43","updateTime":1429450987936,"sequence":350.5,"type":"Manual"},{"bbcode":"DJ Bravo to S Smith, [b]WICKET!!! S Smith is out[/b] c & b Dwayne Bravo","thisOver":"W","progress":{"innings":2,"over":19,"ball":1},"speed":28.5032140131285,"subtype":"BBCode","countingProgress":{"innings":2,"over":18,"ball":1},"bowlerId":25,"nonfacingBatsmanId":135,"facingBatsmanId":271,"autoText":"DJ Bravo to S Smith, <b>WICKET!!! S Smith is out</b> c & b Dwayne Bravo","message":{"text":null},"tags":["wicket"],"timestamp":1429451122000,"id":1166363,"time":"13:43","updateTime":1429451038460,"sequence":351.5,"type":"Auto"},{"bbcode":"[b]Wicket![/b] Now then! It couldn't happen, could it?! Great slower ball by Bravo, and Smith chips it straight back to him!","subtype":"BBCode","message":{"text":"<p><strong>Wicket!</strong> Now then! It couldn't happen, could it?! Great slower ball by Bravo, and Smith chips it straight back to him!</p>"},"tags":[],"timestamp":1429451139000,"id":1166366,"time":"13:45","updateTime":1429451104522,"sequence":352.5,"type":"Manual"},{"bbcode":"DJ Bravo to K Nair. He picks up a single","thisOver":"1","progress":{"innings":2,"over":19,"ball":2},"speed":-1.0,"subtype":"BBCode","countingProgress":{"innings":2,"over":18,"ball":2},"bowlerId":25,"nonfacingBatsmanId":135,"facingBatsmanId":276,"autoText":"DJ Bravo to K Nair. He picks up a single","message":{"text":null},"tags":[],"timestamp":1429451190000,"id":1166369,"time":"13:45","updateTime":1429451116029,"sequence":353.5,"type":"Auto"},{"bbcode":"A flick through mid-wicket brings RR the win!","subtype":"BBCode","message":{"text":"<p>A flick through mid-wicket brings RR the win!</p>"},"tags":[],"timestamp":1429451339000,"id":1166378,"time":"13:47","updateTime":1429451253995,"sequence":354.5,"type":"Manual"},{"bbcode":"[b]Rajasthan Royals win by 8 wickets[/b]","subtype":"BBCode","message":{"text":"<p><strong>Rajasthan Royals win by 8 wickets</strong></p>"},"tags":[],"timestamp":1429451150000,"id":1166371,"time":"13:45","updateTime":1429451150012,"sequence":355.5,"type":"Manual"},{"bbcode":"[b]Match Report: [/b]The Rajasthan Royals maintained their unbeaten record in Pepsi IPL 2015 and firmed up their position at the top of the standings after they defeated the Chennai Super Kings by a resounding eight-wicket margin at the Sardar Patel Stadium in Ahmedabad. Set to chase a modest 157, RR cruised to victory on the back of a record partnership between skipper Shane Watson and Ajinkya Rahane; the hosts got past the finish line with ten deliveries to spare. \\n \\n The pair survived a few anxious moments early on   mistiming a couple of deliveries which just about eluded the CSK fielders - and took time to get used to the pace of the pitch. But once they got used to the pace, they made the necessary adjustments to their bat swing, and started to find the gaps in the field. Both batsmen matched each other run-for-run, even if the means in which they scored were different. While Rahane picked up boundaries along the ground and hit the occasional six, Watson preferred to take the aerial route. Both batsmen got to their respective half-centuries off 35 balls. While the RR skipper brought up his half-century in style smashing Dwayne Bravo over the extra cover boundary, Rahane worked Ashish Nehra for a brace through square-leg. \\n \\n The pair needed 6.4 overs to get to 50, and added the next 50 runs in 4.5 overs. The pair was separated in the 17th over when Ravindra Jadeja s yorker sneaked under the bat of Watson; the RR captain made 73 from 47 balls and hit six fours and four sixes. Rahane, who reclaimed the Orange Cap, finished unbeaten on 76; he consumed 55 balls and hit six fours and two sixes. \\n \\n In the evening, after opting to bat first on a very warm afternoon   with temperatures soaring to a high of 43 degrees celsius, the Chennai Super Kings started off with a bang, with Brendon McCullum hitting Ankit Sharma for two boundaries in the first over. After a quiet second over   bowled by Chris Morris   the Kiwi batsman hit the first ball of the third over straight back past the bowler Pravin Tambe. But the experienced leg-spinner had the last laugh as he deceived the batsman with a quickish delivery and had him holing out to mid on. \\n \\n The other opener - Dwayne Smith - hit three boundaries and two sixes before he dragged a James Faulkner delivery back onto his stumps. His 40 runs   all of which were scored on the leg-side - was the highest score among CSK s top four. \\n \\n Reduced to 65 for 4 after 9.1 overs, CSK needed a move on, and they had just the right men at the crease in Dwayne Bravo and MS Dhoni. Though Dhoni struggled for timing and wasn t his usual self, Bravo chose the right day to score his first IPL half-century for the men in yellow. The Trinidadian used his feet against the RR spinners and was severe particularly against Tambe against who he scored 24 runs from 11 deliveries. He also ran hard between the wickets, cut and pulled, and finished unbeaten on 62; his 36-ball knock was studded with eight boundaries and a six. \\n \\n Bravo s 5th wicket association with his captain lasted 10.5 overs and was worth 91 runs. Dhoni remained unbeaten on 31 from 37 balls. CSK finished their twenty overs at 156 for 4   43 of which came in the last four overs. \\n \\n The Rajasthan Royals used some very unusual tactics on the field   most of which came good on the day. Apart from opening the bowling with left-arm spinner Ankit Sharma, they also used five different bowlers to bowl the first five overs and bowled seven different bowlers in the innings. Four bowlers   Sharma, Chris Morris, Tambe and Faulkner   returned with a wicket apiece. Morris was the best of the RR bowlers; the South African bowled good speeds, bowled plenty of dot deliveries, kept asking questions off every ball and finished with figures of one for 19 from his four overs.","subtype":"BBCode","message":{"text":"<p><strong>Match Report:&nbsp;</strong>The Rajasthan Royals maintained their unbeaten record in Pepsi IPL 2015 and firmed up their position at the top of the standings after they defeated the Chennai Super Kings by a resounding eight-wicket margin at the Sardar Patel Stadium in Ahmedabad. Set to chase a modest 157, RR cruised to victory on the back of a record partnership between skipper Shane Watson and Ajinkya Rahane; the hosts got past the finish line with ten deliveries to spare. <br /> <br /> The pair survived a few anxious moments early on &ndash; mistiming a couple of deliveries which just about eluded the CSK fielders - and took time to get used to the pace of the pitch. But once they got used to the pace, they made the necessary adjustments to their bat swing, and started to find the gaps in the field. Both batsmen matched each other run-for-run, even if the means in which they scored were different. While Rahane picked up boundaries along the ground and hit the occasional six, Watson preferred to take the aerial route. Both batsmen got to their respective half-centuries off 35 balls. While the RR skipper brought up his half-century in style smashing Dwayne Bravo over the extra cover boundary, Rahane worked Ashish Nehra for a brace through square-leg. <br /> <br /> The pair needed 6.4 overs to get to 50, and added the next 50 runs in 4.5 overs. The pair was separated in the 17th over when Ravindra Jadeja&rsquo;s yorker sneaked under the bat of Watson; the RR captain made 73 from 47 balls and hit six fours and four sixes. Rahane, who reclaimed the Orange Cap, finished unbeaten on 76; he consumed 55 balls and hit six fours and two sixes. <br /> <br /> In the evening, after opting to bat first on a very warm afternoon &ndash; with temperatures soaring to a high of 43 degrees celsius, the Chennai Super Kings started off with a bang, with Brendon McCullum hitting Ankit Sharma for two boundaries in the first over. After a quiet second over &ndash; bowled by Chris Morris &ndash; the Kiwi batsman hit the first ball of the third over straight back past the bowler Pravin Tambe. But the experienced leg-spinner had the last laugh as he deceived the batsman with a quickish delivery and had him holing out to mid on. <br /> <br /> The other opener - Dwayne Smith - hit three boundaries and two sixes before he dragged a James Faulkner delivery back onto his stumps. His 40 runs &ndash; all of which were scored on the leg-side - was the highest score among CSK&rsquo;s top four. <br /> <br /> Reduced to 65 for 4 after 9.1 overs, CSK needed a move on, and they had just the right men at the crease in Dwayne Bravo and MS Dhoni. Though Dhoni struggled for timing and wasn&rsquo;t his usual self, Bravo chose the right day to score his first IPL half-century for the men in yellow. The Trinidadian used his feet against the RR spinners and was severe particularly against Tambe against who he scored 24 runs from 11 deliveries. He also ran hard between the wickets, cut and pulled, and finished unbeaten on 62; his 36-ball knock was studded with eight boundaries and a six. <br /> <br /> Bravo&rsquo;s 5th wicket association with his captain lasted 10.5 overs and was worth 91 runs. Dhoni remained unbeaten on 31 from 37 balls. CSK finished their twenty overs at 156 for 4 &ndash; 43 of which came in the last four overs. <br /> <br /> The Rajasthan Royals used some very unusual tactics on the field &ndash; most of which came good on the day. Apart from opening the bowling with left-arm spinner Ankit Sharma, they also used five different bowlers to bowl the first five overs and bowled seven different bowlers in the innings. Four bowlers &ndash; Sharma, Chris Morris, Tambe and Faulkner &ndash; returned with a wicket apiece. Morris was the best of the RR bowlers; the South African bowled good speeds, bowled plenty of dot deliveries, kept asking questions off every ball and finished with figures of one for 19 from his four overs.</p>"},"tags":[],"timestamp":1429453120000,"id":1166372,"time":"13:45","updateTime":1429451157521,"sequence":356.5,"type":"Manual"},{"bbcode":"[b]Dhoni: [/b]\"I think it was an off day for us. We started off pretty well, but when I went in to bat, I ate up too many deliveries and should have rotated the strike. They batted really well. I felt it did play according to what we thought. Maybe the travelling took it out of us. When you lose, you have to make sure you come back strongly.\"","subtype":"BBCode","message":{"text":"<p><strong>Dhoni:&nbsp;</strong>\"I think it was an off day for us. We started off pretty well, but when I went in to bat, I ate up too many deliveries and should have rotated the strike. They batted really well. I felt it did play according to what we thought. Maybe the travelling took it out of us. When you lose, you have to make sure you come back strongly.\"</p>"},"tags":[],"timestamp":1429451491000,"id":1166373,"time":"13:46","updateTime":1429451161659,"sequence":357.5,"type":"Manual"},{"bbcode":"[b]Watson: [/b]\"It's really nice to be playing back for the Royals. It was nice to get out there and perform well against a good Chennai side. It was a bit of a slow pitch, but was still a good wicket. We summed up the conditions quickly when we bowled, and we knew we just had to have wickets in hand with the bat. We know early wickets against Chennai are important. Bravo batted really well to provide us with a challenge. We're getting better as a side every year. Our new recruits compliment our squad.\"","subtype":"BBCode","message":{"text":"<p><strong>Watson:&nbsp;</strong>\"It's really nice to be playing back for the Royals. It was nice to get out there and perform well against a good Chennai side. It was a bit of a slow pitch, but was still a good wicket. We summed up the conditions quickly when we bowled, and we knew we just had to have wickets in hand with the bat. We know early wickets against Chennai are important. Bravo batted really well to provide us with a challenge. We're getting better as a side every year. Our new recruits compliment our squad.\"</p>"},"tags":[],"timestamp":1429452316000,"id":1166374,"time":"13:46","updateTime":1429451165553,"sequence":358.5,"type":"Manual"},{"bbcode":"[b]MoM: [/b]Ajinkya Rahane","subtype":"BBCode","message":{"text":"<p><strong>MoM:&nbsp;</strong>Ajinkya Rahane</p>"},"tags":[],"timestamp":1429452331000,"id":1166375,"time":"13:46","updateTime":1429451169227,"sequence":359.5,"type":"Manual"},{"subtype":"EmbeddedTweet","tweetjson":{"created_at":"Sun Apr 19 13:55:02 +0000 2015","id":589789303355494401,"id_str":"589789303355494401","text":"Rajasthan Royals. What a win. Clinical! #IPL #RRvCSK","source":"<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>","truncated":false,"in_reply_to_status_id":null,"in_reply_to_status_id_str":null,"in_reply_to_user_id":null,"in_reply_to_user_id_str":null,"in_reply_to_screen_name":null,"user":{"id":2939953748,"id_str":"2939953748","name":"Zain Mallick","screen_name":"MallickZain","location":"Riyadh","profile_location":null,"description":"Future Civil Engineer in sha Allah. 21; Muslim; Gamer; Baller; Barcelona and Liverpool fan. Pakistani Cricket fan. Live and let live.","url":"http://t.co/ARKEZevMyc","entities":{"url":{"urls":[{"url":"http://t.co/ARKEZevMyc","expanded_url":"http://www.facebook.com/zainarshed","display_url":"facebook.com/zainarshed","indices":[0,22]}]},"description":{"urls":[]}},"protected":false,"followers_count":122,"friends_count":457,"listed_count":2,"created_at":"Mon Dec 22 19:47:33 +0000 2014","favourites_count":331,"utc_offset":null,"time_zone":null,"geo_enabled":true,"verified":false,"statuses_count":2213,"lang":"en","contributors_enabled":false,"is_translator":false,"is_translation_enabled":false,"profile_background_color":"000000","profile_background_image_url":"http://abs.twimg.com/images/themes/theme1/bg.png","profile_background_image_url_https":"https://abs.twimg.com/images/themes/theme1/bg.png","profile_background_tile":false,"profile_image_url":"http://pbs.twimg.com/profile_images/584840454375542784/nNfigJ56_normal.jpg","profile_image_url_https":"https://pbs.twimg.com/profile_images/584840454375542784/nNfigJ56_normal.jpg","profile_banner_url":"https://pbs.twimg.com/profile_banners/2939953748/1421083941","profile_link_color":"3B94D9","profile_sidebar_border_color":"000000","profile_sidebar_fill_color":"000000","profile_text_color":"000000","profile_use_background_image":false,"default_profile":false,"default_profile_image":false,"following":false,"follow_request_sent":false,"notifications":false},"geo":null,"coordinates":null,"place":null,"contributors":null,"retweet_count":0,"favorite_count":0,"entities":{"hashtags":[{"text":"IPL","indices":[40,44]},{"text":"RRvCSK","indices":[45,52]}],"symbols":[],"user_mentions":[],"urls":[]},"favorited":false,"retweeted":false,"lang":"en"},"message":{"text":"<blockquote class=\"twitter-tweet\" data-partner=\"tweetdeck\">\n<p>Rajasthan Royals. What a win. Clinical! <a href=\"https://twitter.com/hashtag/IPL?src=hash\">#IPL</a> <a href=\"https://twitter.com/hashtag/RRvCSK?src=hash\">#RRvCSK</a></p>\n&mdash; Zain Mallick (@MallickZain) <a href=\"https://twitter.com/MallickZain/status/589789303355494401\">April 19, 2015</a></blockquote>\n<script charset=\"utf-8\" type=\"text/javascript\" src=\"http://platform.twitter.com/widgets.js\"></script>"},"tags":[],"timestamp":1429451715000,"id":1166396,"time":"13:55","updateTime":1429451715893,"sequence":360.5,"type":"Manual"},{"bbcode":"What a performance by Rajasthan Royals. The clash of the two unbeaten sides ended with a convincing victory. Watson's men were fantastic with the ball, and then supreme with the bat. For Dhoni and his troops, a chance to regroup and go again. Thanks for your company today, but all the fun's not over. We've got a six hitting fest in Bangalore just about to come up. Anderson, Pollard, Gayle, Kohli, AB and Rohit, just for starters - we can't wait!","subtype":"BBCode","message":{"text":"<p>What a performance by Rajasthan Royals. The clash of the two unbeaten sides ended with a convincing victory. Watson's men were fantastic with the ball, and then supreme with the bat. For Dhoni and his troops, a chance to regroup and go again. Thanks for your company today, but all the fun's not over. We've got a six hitting fest in Bangalore just about to come up. Anderson, Pollard, Gayle, Kohli, AB and Rohit, just for starters - we can't wait!</p>"},"tags":[],"timestamp":1429452142000,"id":1166406,"time":"14:02","updateTime":1429452142617,"sequence":361.5,"type":"Manual"}]}